Repository: abdesselam-arch/map
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Home
ar: الصفحة الرئيسية

source: Search
ar: بحث

source: Settings
ar: الاعدادات

source: Change Language
ar: تغيير اللغة

source: Welcome back!
ar: مرحبا

source: Email
ar: البريد الالكتروني

source: Password
ar: كلمة المرور

# singIn
source: Sign in
ar: تسجيل الدخول

source: Not a member?
ar: ليس لديك حساب?

source: Register now
ar: افتح حساب

source: Create an account
ar: فتح حساب جديد

source: Confirm password
ar: تأكيد كلمة المرور

source: Sign up
ar: افتح حساب

# alreadyAmember
source: Already have an account?
ar: هل لديك حساب?

source: Login now
ar: تسجيل الدخول

source: My details
ar: التفاصيل الشخصية

source: Save
ar: تاكيد

source: Cancel
ar: الغاء

source: Submit
ar: تاكيد

source: Departure
ar: موقع المغادرة

source: Arrival
ar: موقع الوصول

# emailReset
source: Enter your email so we can send you a password reset link
ar: أدخل بريدك الإلكتروني حتى نتمكن من إرسال رابط إعادة تعيين كلمة المرور إليك

source: Reset password
ar: إعادة تعيين كلمة المرور

# forgotPassButton
source: Forgot password?
ar: نسيت كلمة المرو?

# purposeField
source: Purpose
ar: السبب

source: Travel
ar: رحلة

source: Education
ar: دراسة

# medical
source: Medical condition
ar: اسباب طبية

source: Work
ar: عمل

source: Vacation
ar: عطلة

source: Visit
ar: زيارة

source: Shopping
ar: التسوق

source: Other
ar: سبب آخر

source: By car
ar: بالسيارة

source: By bike
ar: بالدراجة

# onFoot
source: By walk
ar: على الاقدام

source: Distance:
ar: المسافة:

# depTime
source: Departure time:
ar: وقت المغادرة:

# arrTime
source: Arrival time:
ar: وقت الوصول:

source: Travel mean:
ar: وسيلة نقل:

source: Weather informations
ar: معلومات عن الطقس:

# temp
source: Temperature:
ar: درجة الحرارة:

# descMeteo
source: Description:
ar: وصف الطقس:

source: Arrival Time
ar: وقت الوصول

# publicTransport
source: Public transport options
ar: خيارات النقل العام

# heartRateAdvice
source: Your heart rate is high. Consider taking a break.
ar: معدل ضربات قلبك مرتفع. فكر في أخذ قسط من الراحة.

# bloodPressureAdvice
source: Your blood pressure is high. Avoid strenuous activities and travel.
ar: ضغط دمك مرتفع. تجنب الأنشطة المجهدة والسفر.

# bloodGlucoseAdvice
source: Your blood glucose level is high. Monitor your diet and consider avoiding sugary foods.
ar: مستوى الجلوكوز في الدم لديك مرتفع. راقب نظامك الغذائي وفكر في تجنب الأطعمة السكرية.

# bloodOxyAdvice
source: Your blood oxygen level is low. Consider resting and staying indoors.
ar: مستوى الأكسجين في الدم لديك منخفض. فكر في الراحة والبقاء في الداخل.

# healthConditionnormal
source: Your health condition seems to be normal. Keep up the good work!
ar: يبدو أن حالتك الصحية طبيعية. ثابر على العمل الجيد!

source: Heart rate:
ar: معدل ضربات القلب

# bodyTemp
source: Body temparture:
ar: درجة حرارة الجسم

# respRate
source: Respiratory rate:
ar: معدل التنفس

source: Blood pressure:
ar: ضغط الدم

# bloodOxy
source: Blood Oxygen saturation low:
ar: تشبع الأكسجين في الدم منخفض

# bloodSugar
source: Blood sugar level:
ar: مستوى السكر في الدم

# noHealthProbs
source: There are no obvious Health Problems!
ar: لا توجد مشاكل صحية واضحة!

# arriveincar
source: Will arrive in time in car
ar: سيصل في الوقت المناسب بالسيارة

# arriveinbike
source: Will arrive in time in bike
ar: سيصل في الوقت المناسب بالدراجة

# arrivebywalk
source: Will arrive in time by walk
ar: سوف يصل في الوقت المناسب سيرا على الأقدام

source: Health problems detected
ar: تم اكتشاف مشاكل صحية

source: Current Time and Date
ar: الوقت والتاريخ الحاليين

source: Time of day:
ar: وقت اليوم:

# date
source: The date:
ar: التاريخ:

# options
source: Options you can add
ar: الخيارات التي يمكنك إضافتها

source: Departure Time
ar: وقت الانطلاق

source: Departure Date
ar: تاريخ الانطلاق

# routeInfos
source: Route informations
ar: معلومات الطريق

source: Duration:
ar: المدة:

source: km
ar: كم

# min
source: minutes
ar: دقيقة

# noitem
source: Address not found!
ar: لم يتم العثور على عنوان!

# selectDepTime
source: Select departure time
ar: حدد وقت المغادرة

# selectArrTime
source: Select arrival time
ar: حدد وقت الوصول

# wherewego
source: where are we going ?
ar: إلى أين نحن ذاهبون ؟

source: Health advice list
ar: قائمة النصائح الصحية

source: Instructions
ar: تعليمات الطريق
